# 리스트의 CRUD3S
# C: create.
# R: read
# U: update
# D: delete
# S: search
# S: sort
# S: shuffle


############################
# 리스트 선언
array = []

# 공백 리스트 생성
list1 = []
list2 = list()
# 리스트 안에는 딕셔너리, 리스트, 함수까지 포함 가능.
list1 = ["문자", 1, 1.1, [0, 1], {"a": 1, "1": "BA"}, None]
print(list1)
# 문자 H, e, l, l, o를 요소로 가지는 리스트
list2 = list("hello")
print(list2)
# 문자열 Hello를 요소로 가지는 리스트
list3 = ["hello"]
print(list3)
# 0, 1, 2, 3, 4를 요소가 가지는 리스트 생성
# 공백 리스트 생성
# 문자열을 리스트로 변환. 문자 H, e, l, l, o를 요소로 가지는 리스트 생성
# 0, 1, 2, 3, 4를 요소가 가지는 리스트 생성
############################
############################
# 리스트 요소 출력
############################

############################
# 리스트 출력
############################

############################
# 리스트 슬라이싱
flist = ["apple", "banana", "tomato", "peach", "pear"]
print("", flist[0])
print("", flist[1:3])

############################

############################
# 리스트 요소 대입, 기존 리스트의 값을 변경
print(flist[0])
flist[0] = "strawberry"
print(flist)
############################
flist.append("garlic")
print(flist)
flist.insert(2, "grape")
print(flist)
############################
# 리스트 열거
############################

############################
# 복잡한 리스트
# 1차원 리스트
# 2차원 리스트
# 3차원 리스트
############################


############################
# 리스트에 담을 수 있는 것은?
# 리스트 선언
# 리스트 대입
# 리스트 출력
# 리스트 열거
# 리스트에 저장된 함수 실행하기
############################

############################
# 문자열 vs 리스트
############################
